<a href="https://colab.research.google.com/github/Richofedhias/Data_Survive_Titanic/blob/main/Data_Survive_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import math
from sklearn.preprocessing import LabelEncoder

In [ ]:
dtrain = pd.read_csv('sample_data/train.csv')

In [ ]:
dtrain.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [ ]:
# dtrain = dtrain.drop(['PassengerId'], axis = 1)
# dtrain = dtrain.drop(['Name'], axis = 1)
dtrain = dtrain.drop(['Ticket'], axis = 1)
dtrain = dtrain.drop(['Cabin'], axis = 1)
# Untuk Drop Tabel

In [ ]:
dtrain['Cabin'].describe()
# Untuk Menjelaskan kolomnya

count         204
unique        147
top       B96 B98
freq            4
Name: Cabin, dtype: object

In [ ]:
dtrain['Embarked'].describe()
# Untuk Menjelaskan kolomnya

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [ ]:
dtrain['Sex'].isna().sum()
# Untuk Menjelaskan data yang kosong

0

In [ ]:
dtrain.corr(method='spearman')
# Mencari Korelasi antar kolom

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.339668 -0.052565  0.088879  0.138266  0.323736
Pclass   -0.339668  1.000000 -0.361666 -0.043019 -0.022801 -0.688032
Age      -0.052565 -0.361666  1.000000 -0.182061 -0.254212  0.135051
SibSp     0.088879 -0.043019 -0.182061  1.000000  0.450014  0.447113
Parch     0.138266 -0.022801 -0.254212  0.450014  1.000000  0.410074
Fare      0.323736 -0.688032  0.135051  0.447113  0.410074  1.000000

In [ ]:
dtrain = dtrain[dtrain['Embarked']. notna()]
# Untuk Mengisi Data yang kosong

In [ ]:
dtrain.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [ ]:
dtrain["Age"].fillna(method="ffill")

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 712, dtype: float64

In [ ]:
dtrain['Age'].describe()

count    712.000000
mean      29.642093
std       14.492933
min        0.420000
25%       20.000000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [ ]:
dtrain['Age'] = dtrain["Age"].astype(np.int64)
# Convert to integer

In [ ]:
dtrain.head()

   Survived  Pclass     Sex  Age  SibSp  Parch     Fare Embarked
0         0       3    male   22      1      0   7.2500        S
1         1       1  female   38      1      0  71.2833        C
2         1       3  female   26      0      0   7.9250        S
3         1       1  female   35      1      0  53.1000        S
4         0       3    male   35      0      0   8.0500        S

In [ ]:
dtrain["Sex"].unique()

array(['male', 'female'], dtype=object)

In [ ]:
dtrain.loc[dtrain['Sex'] == 0]

   Survived  Pclass Sex  Age  SibSp  Parch     Fare Embarked
0         0       3   0   22      1      0   7.2500        S
1         1       1   0   38      1      0  71.2833        C
2         1       3   0   26      0      0   7.9250        S
3         1       1   0   35      1      0  53.1000        S
4         0       3   0   35      0      0   8.0500        S

In [ ]:
dtrain = dtrain[dtrain['Sex'] != 0]

In [ ]:
label_enc = LabelEncoder()
dtrain["Sex"] = label_enc.fit_transform(dtrain["Sex"])

In [ ]:
dtrain.head()

    Survived  Pclass  Sex  Age  SibSp  Parch     Fare  Embarked
6          0       1    1   54      0      0  51.8625         2
7          0       3    1    2      3      1  21.0750         2
8          1       3    0   27      0      2  11.1333         2
9          1       2    0   14      1      0  30.0708         0
10         1       3    0    4      1      1  16.7000         2

In [ ]:
label_enc = LabelEncoder()
dtrain["Embarked"] = label_enc.fit_transform(dtrain["Embarked"])